#Hex სისტემა
#Hexadecimal Color Code (Hex) არის ფერების განსახიერების ფორმატი, რომელიც იყენებს 16-წლიან სისტემას. თითოეული ფერი წარმოდგენილია 6 სიმბოლოს საშუალებით, რაც ნიშნავს, რომ თითოეული ფერის მნიშვნელობა შეიძლება იყოს 00-FF (0-255).

#მახასიათებლები:

#წერის სტილი: ფერის კოდი იწყება სიმბოლოთი #, რასაც მოჰყვება 6 სიმბოლო (მაგ. #FF5733).
#განაწილება: პირველი ორი სიმბოლო ჩრდილზე (Red), მეორე ორი სიმბოლო მწვანეზე (Green), და მესამე ორი სიმბოლო ლურჯზე (Blue) იმაზე მიუთითებს, რაც ჯამში ქმნის ფერს.
#დადებითი მხარეები:

#მარტივი და კომპაქტური ფორმატი.
#ვიზუალურად ადვილია აღქმა.
#უარყოფითი მხარეები:

#შეიძლება რთული იყოს, რომ გარკვეული ფერები გამოიცნონ, რადგან არ არსებობს პირდაპირი დამახასიათებელი სიტყვის გამოყენება.
#RGB სისტემა
#RGB (Red, Green, Blue) ფერის მოდელი წარმოადგენს ფერების შერევას სამი ძირითადი ფერის (წითელი, მწვანე, ლურჯი) საშუალებით. RGB ფერების კოდი შეიძლება იყოს 0-255 რაოდენობა.

#ახასიათებლები:

#წერის სტილი: ფერები ინიშნება ისე, რომ: rgb(255, 87, 51), სადაც თითოეული მახასიათებელი არის R, G, B-ის მნიშვნელობები.
#განაწილება: თითოეული კომპონენტი ასახავს კონკრეტულ წილზე ფერის ინტენსივობას.
#დადებითი მხარეები:

#იძლევა ძალიან ფართო სპექტრს ფერების.
#მარტივი და ინტუიციური თეორია, რაც საშუალებას გაწვდოს პირდაპირი მნიშვნელობები.
#უარყოფითი მხარეები:

#RGB კოდები ხშირად უფრო გრძელი და რთული მახასიათებლები ქმნიან.
#ნაკლებად მარტივია ზოგადი აღქმისა (როგორ ჩნდება ფერი).