#შექმენით ცვლადი სადაც მიანიჭებთ თქვენს სახელს ეს ცვლადი უნდა დააკომენტაროთ და დაპრინტოთ და ახსნათ კომენტარებით რატომ ვერ გამოიტანს ცვლადის მნიშვნელობას

nika = "bichs"

#ცვლადი=nika
#მნიშვნელობა=bichi

print("nika")

#ამ შემთხვევაში ტერმინალი ეკრანზე გამოიტანს არა ცვლადის მნიშვნელობას არამედ თვითნ მოცემულ ბრძანებას რომელიც მივეცით მას დასაპრინტად

print(nika)

#ხოლო ამ შემთხვევაში ტერმინალი გამოიტანს ცვლადის მნიშვნელობას ვინაიდან ჩვენ ზემოთ კომპიუტერს მივეცით მითითება თუ რა იყო ცვლადის მნიშვნელობა
#პირველ მაგალითში ტერმინალზე გამოვიდა თვითნ ცვლადი რადგან იგი ჩავწერეთ ""ში ამით ბრძანება მივეცით რომ დაეპრინტა არა მისი მნიშვნელობა არამედ თავად ის

