#3) შექმენით ცვლადი რომელიც იქნება name და მინიჭებული იქნება თქვენი სახელი და უნდა დაპრინტოთ ეს ცვლადი სწორი გზით და არასწორი გზით და უნდა ახსნათ კომენტარებით რატომ არის ეს გზა სწორი და რატომ არ არის ეს გზა სწორი
 
name = "Elene"
print(name)
#ეს არის სწორი კოდი რადგან არანაირი შეცდომები არ აქვს ყველა ნიშანი არის თავის ადგილზე რამე არასწორი რომ იყოს კოდი არ გაიშვება ამჯერად კოდი გაიშვა )

# name - ,Elene,
# print= "Elene"
#ეს არის არასწორი კოდი რადგან name -ის გვერდით უნდა იყოს ტოლობა ასევე მითითებული სახელი უნა იყოს ბრჭყალებში რაც შეეხება prints ტოლობა არ გვჭირდება მითითებული სახელის მაგივრად უნდა ეწეროს name  და ეს ყველაფერი ფრჩხილებში სანამ ეს კოდო არ იქნება შესწორებული კოდის ტერმინალში ეწერება error ამიტომაც ჯობიქ შევასწოროთ.