#4) დაპრინტეთ GOA is the best academy in georgia სწორი გზით და არასწორი გზით და ახსენით კომენტარებით რატომ არის ეკ გზა სწორი და რატომ არ არის მეორე გზა სწორი

name = "GOA is the best academy in georgia " 
print(name)
#როგორც ვთქვით ეს არის სრულიად  სწორი კოდი ,კოდი თუ გაიშვა და error - ს არ წერს ესეიგი ეს კოდო სწორია .

#name * -GOA is the best academy in georgia-
#print + ,name, 
#ეს კიდევ არის ისევ არასწორი კოდი name - ს შემდეგ უნდა იყოს ტოლობა დეფისის მაგივრად უნდა იყოს ბრჭყაკები print - ის შემდეგ მიმატების მაგივრად უნა იყოს ფრჩხილები მძიმე საეროდ გამოვრიცხოდ ესეც არ გვჭირდება , სანამ კოდი დარჩება არა შესწორებულად კოდი არ გაიშვება და ტერმინალში დაიწერება error (